(setq xenops-font-font-family "Latin Modern Math")
(setq xenops-xen-style-rules
      (append xenops-xen-style-rules
              '(("\\R" . "ℝ")
                ("\\N" . "ℕ")
                ("\\C" . "ℂ")
                ("\\Q" . "ℚ")
                ("\\Z" . "ℤ")
                ("\\Lag" . "L")

                ;; ("\\\\" . "⏎")
                ("\\\\" . " ")

                (" ~ " . " ")

                ("\\correct" . "☑")
                ("\\todo" . "TODO")

                ("\\vecMMM" . "\\vec")
                ("\\bvecMMM" . "\\vec")

                ("\\begin{mdframed}" . "⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯")
                ("\\end{mdframed}" . "⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯")

                ;; TODO: DNW?
                ("\\Bigg[" . "[")
                ("\\Bigg]" . "]")
                ("\\Bigg(" . "(")
                ("\\Bigg)" . ")")

                ("&=" . "=")

                ("\\dt" . "dt")
                ("\\du" . "du")
                ("\\dv" . "dv")
                ("\\dx" . "dx")
                ("\\dy" . "dy")

                ;; https://unicode-table.com/en/0307/
                ;; U+0307 Combining Dot Above
                ("\\dot{\\r}" . "ṙ")
                ("\\dot{\\v}" . "v̇")
                ("\\dot{x}" . "ẋ")
                ("\\dot{y}" . "ẏ")

                ("\\xdot" . "ẋ")
                ("\\ydot" . "ẏ")

                ("\\ddot{\\r}" . "r̈")

                ("\\xddot" . "ẍ")
                ("\\yddot" . "ÿ")


                ;; ("$" . " " ) ;; ⚡  "​" zero-width space
                ("\\d\\r" . "dr")
                ("\\r" . "r")
                ("\\v" . "v")
                ("\\F" . "F"))))
